In [1]:
import pandas as pd
import numpy as np

In [2]:
# create apples and oranges series
apples = pd.Series([3,2,0,1])
oranges = pd.Series([3,2,0,1])

print(apples, oranges)

0    3
1    2
2    0
3    1
dtype: int64 0    3
1    2
2    0
3    1
dtype: int64

In [3]:
# create dictionary
data = {"apples": apples, "oranges": oranges}

# create DataFrame
fruits_df = pd.DataFrame(data)
print(fruits_df)

   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [4]:
# create dictionary
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
print(frame)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [5]:
# create dictionary
# Write index name Manualy
# index name and values will be equal
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

state_pop_df = pd.DataFrame(data, index = ['1st', '2nd', '3rd', '4th', '5th', '6th'])
print(state_pop_df)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [6]:
# if we display top five values to given frame than use .head
state_pop_df.head()

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9

In [7]:
# if we display top five values to given frame than use .head
# .head(n: int = 5)  default int = 5 we can change it
state_pop_df.head(3)

    state  year  pop
1st  Ohio  2000  1.5
2nd  Ohio  2001  1.7
3rd  Ohio  2002  3.6

In [8]:
# if we display top five values to given frame than use .head
# .head(n: int = 5)  default int = 5 we can change it
state_pop_df.head(10)

      state  year  pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.6
4th  Nevada  2001  2.4
5th  Nevada  2002  2.9
6th  Nevada  2003  3.2

In [9]:
# write columns name to your choice mean we write first position is 'year'
state_pop_df = pd.DataFrame(data, columns = ['year', 'state', 'pop'])
state_pop_df.head()

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [10]:
# we add an extra column name 'debt'
# the 'debt' column show none(NaN) value
state_pop_df2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                                   index   = ['one', 'two', 'three', 'four', 'five', 'six'])
state_pop_df2.head()

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [11]:
print(state_pop_df2.columns)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [12]:
print(state_pop_df2.index)

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

# A Column In A DataFrame Can Be Retrieved As A Series Either By Dictionary-Like Notation Or By Attribute:

In [13]:
# Dictionary-Like Notation means if we access some thing in dictionary
# We write first Dictionary name and use sqare brackits and enter key
# data is a dictionary name

print(data)
data['state']

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

In [14]:
# Dictionary-Like Notation means if we access some thing in dictionary
# We write first Dictionary name and use sqare brackits and enter key
# data is a dictionary name

print(data)
data['year']

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

[2000, 2001, 2002, 2001, 2002, 2003]

In [15]:
# Dictionary-Like Notation means if we access some thing in dictionary
# We write first Dictionary name and use sqare brackits and enter key
# data is a dictionary name

print(data)
data['pop']

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]

In [16]:
# Pandas DataFrame use Dictionary-Like Notation
# this is Dictionary-Like Notation to access or extract
# DataFrame column data
state_pop_df2["year"]

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [17]:
# Pandas DataFrame use Dictionary-Like Notation
# this is Dictionary-Like Notation to access or extract
# DataFrame column data
state_pop_df2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [18]:
# Pandas DataFrame use Dictionary-Like Notation
# this is Dictionary-Like Notation to access or extract
# DataFrame column data
state_pop_df2["pop"]

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [19]:
# Pandas DataFrame use Dictionary-Like Notation
# this is Dictionary-Like Notation to access or extract
# DataFrame column data
state_pop_df2["debt"]

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [20]:
# there state_pop_df2 is another method, attribute style of accessing DataFrame Data
# attribute style data
state_pop_df2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [21]:
# there state_pop_df2 is another method, attribute style of accessing DataFrame Data
# attribute style data
state_pop_df2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [22]:
# there state_pop_df2 is another method, attribute style of accessing DataFrame Data
# attribute style data
state_pop_df2.pop

<bound method NDFrame.pop of        year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN>

In [23]:
# there state_pop_df2 is another method, attribute style of accessing DataFrame Data
# attribute style data
state_pop_df2.debt

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [24]:
# another way to access, extract data is location(loc)
# in this method we select column
state_pop_df2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [25]:
# another way to access, extract data is location(loc)
state_pop_df2.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [26]:
# another way to access, extract data is location(loc)
state_pop_df2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [27]:
# another way to access, extract data is location(loc)
state_pop_df2.loc['four']

year       2001
state    Nevada
pop         2.4
debt        NaN
Name: four, dtype: object

In [28]:
# another way to access, extract data is location(loc)
state_pop_df2.loc['five']

year       2002
state    Nevada
pop         2.9
debt        NaN
Name: five, dtype: object

In [29]:
# another way to access, extract data is location(loc)
state_pop_df2.loc['six']

year       2003
state    Nevada
pop         3.2
debt        NaN
Name: six, dtype: object

In [30]:
# another way to access, extract data is location(loc)
print(state_pop_df2.loc['one'])

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [31]:
# import cell for codes review

# create dictionary
# Write index name Manualy
# index name and values will be equal
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

state_pop_df2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                                   index   = ['one', 'two', 'three', 'four', 'five', 'six'])

print(len(state_pop_df2))
print(state_pop_df2)

#rng = np.arang(6.0)
#print(rng)
#state_pop_df2['debt'] = rng
#state_pop_df2

6
       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [32]:
# import cell for codes review

# create dictionary
# Write index name Manualy
# index name and values will be equal
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

state_pop_df2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                                   index   = ['one', 'two', 'three', 'four', 'five', 'six'])

print(len(state_pop_df2)) # finding number of rows in DataFrame
print(state_pop_df2)

# create new array name is rng
rng = np.arange(6.0)
print(rng)
#state_pop_df2['debt'] = rng
#state_pop_df2

6
       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN
[0. 1. 2. 3. 4. 5.]

In [33]:
# import cell for codes review

# create dictionary
# Write index name Manualy
# index name and values will be equal
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

state_pop_df2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                                   index   = ['one', 'two', 'three', 'four', 'five', 'six'])

# create variable ln and save the length
ln = len(state_pop_df2) # finding number of rows in DataFrame
print(state_pop_df2)
print(ln)

# create new array name is rng
rng = np.arange(ln)
print(rng)
#state_pop_df2['debt'] = rng
#state_pop_df2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN
6
[0 1 2 3 4 5]

In [34]:
# import cell for codes review

# create dictionary
# Write index name Manualy
# index name and values will be equal
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year' : [2000, 2001, 2002, 2001, 2002, 2003],
         'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

state_pop_df2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                                   index   = ['one', 'two', 'three', 'four', 'five', 'six'])

# create variable ln and save the length
ln = len(state_pop_df2) # finding number of rows in DataFrame
#print(state_pop_df2)

# create new array name is rng
rng = np.arange(ln)
print(rng)
state_pop_df2['debt'] = rng
state_pop_df2

[0 1 2 3 4 5]

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

# Point To Remember, Inserting New Values, Needs To Be Match In Length Of DataFrame (Number Of Elements)

In [35]:
# filling the column debt
val = pd.Series([-1.2, -1.5, -1.7, -1.2, -1.5, -1.7, 2.2],
               index   = ['one', 'two', 'three', 'four', 'five', 'six', 'seven'])
state_pop_df2['debt'] = val
state_pop_df2

       year   state  pop  debt
one    2000    Ohio  1.5  -1.2
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6  -1.7
four   2001  Nevada  2.4  -1.2
five   2002  Nevada  2.9  -1.5
six    2003  Nevada  3.2  -1.7

In [36]:
# filling the column debt
# the debt column value NaN at position one and three because we can't write these positin values
val = pd.Series([-1.2, -1.5, -1.7, 2.2],
               index   = ['two', 'four', 'five', 'six'])
state_pop_df2['debt'] = val
state_pop_df2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   2.2

# Remember! Index Length Must Be Equal To Values (or, do not provide index)

In [37]:
# Mind Teaser !!
# Assigning a column that already exist will _____and
# Assigning a column that does not exist will________

In [38]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 3, 6])
print( obj3 )

# reindexing
obj3 = obj3.reindex(range(9), method = 'ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [39]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 3, 6])
print( obj3 )

# reindexing
obj3 = obj3.reindex(range(6), method = 'ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
dtype: object

In [40]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 3, 6])
print( obj3 )

# reindexing
obj3 = obj3.reindex(range(8), method = 'ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
dtype: object

In [41]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0, 3, 6])
print( obj3 )

# reindexing
obj3 = obj3.reindex(range(5), method = 'ffill')
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
dtype: object

# Column Can Be Modified By Assignment. For Example, The Empty 'debt' Column Could Be Assigned A Scalar Value Or An Array Of Values:

In [42]:
# assign value in 'debt' column
state_pop_df2['debt'] = 16.5
state_pop_df2.head()

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5